Repository: liuzeyi11/GovernmentWorkReportCorpus
Catalog: government_report_tmx_file/GR2021.tmx
Source language: en_us
Languages: zh_cn

source: We in government at all levels should vigorously support the development of national defense and the armed forces, and conduct extensive activities to promote mutual support between the civilians and the military, so as to forge an ever closer bond between the people and the military in the new era.
zh_cn: 各级政府要大力支持国防和军队建设，深入开展“双拥”活动，谱写鱼水情深的时代华章。

source: We will stay true to the letter and spirit of the principle of One Country, Two Systems, under which the people of Hong Kong administer Hong Kong and the people of Macao administer Macao, both with a high degree of autonomy.
zh_cn: 我们要继续全面准确贯彻“一国两制”、“港人治港”、“澳人治澳”、高度自治的方针，

source: We will improve the relevant systems and mechanisms of the two special administrative regions for enforcing the Constitution and the basic laws;
zh_cn: 完善特别行政区同宪法和基本法实施相关的制度和机制，

source: we will ensure the implementation of the laws and enforcement mechanisms for the two regions to safeguard national security.
zh_cn: 落实特别行政区维护国家安全的法律制度和执行机制。

source: We will resolutely guard against and deter external forces' interference in the affairs of Hong Kong and Macao.
zh_cn: 坚决防范和遏制外部势力干预港澳事务，

source: We will support both regions as they grow their economies and improve people's lives, so as to maintain the long-term prosperity and stability of Hong Kong and Macao.
zh_cn: 支持港澳发展经济、改善民生，保持香港、澳门长期繁荣稳定。

source: We remain committed to the major principles and policies on work related to Taiwan, to the one-China principle and the 1992 Consensus, and to promoting the peaceful growth of relations across the Taiwan Strait and China's reunification.
zh_cn: 我们要坚持对台工作大政方针，坚持一个中国原则和“九二共识”，推进两岸关系和平发展和祖国统一。

source: We will remain highly vigilant against and resolutely deter any separatist activity seeking “Taiwan Independence.”
zh_cn: 高度警惕和坚决遏制“台独”分裂活动。

source: We will improve the systems and policies for safeguarding the wellbeing of our Taiwan compatriots and ensuring they enjoy the same treatment on China's mainland as local residents.
zh_cn: 完善保障台湾同胞福祉和在大陆享受同等待遇的制度和政策，

source: We will promote exchanges, cooperation, and integrated development across the Taiwan Strait.
zh_cn: 促进海峡两岸交流合作、融合发展，

source: Together, we can shape a bright future of rejuvenation for our great nation.
zh_cn: 同心共创民族复兴美好未来。

source: China will continue to pursue an independent foreign policy of peace.
zh_cn: 我们要坚持独立自主的和平外交政策，

source: We will actively work to develop global partnerships and promote the building of a new type of international relations and a human community with a shared future.
zh_cn: 积极发展全球伙伴关系，推动构建新型国际关系和人类命运共同体。

source: We will continue to pursue the policy of opening up and cooperation and work to make the system of global governance fairer and more equitable.
zh_cn: 坚持开放合作，推动全球治理体系朝着更加公正合理的方向发展。

source: We will continue to deepen international and regional cooperation, and actively participate in international cooperation to prevent and control major infectious diseases.
zh_cn: 持续深化国际和地区合作，积极参与重大传染病防控国际合作。

source: China remains committed to pursuing peaceful coexistence and common development with all other countries in accordance with the principle of mutual respect, equality, and mutual benefit. China will join hands with them to meet global challenges and work tirelessly to promote world peace and prosperity.
zh_cn: 中国愿同所有国家在相互尊重、平等互利基础上和平共处、共同发展，携手应对全球性挑战，为促进世界和平与繁荣不懈努力！

source: As we shoulder heavy responsibilities, we must forge ahead with even greater resolve.
zh_cn: 重任在肩，更须砥砺奋进。

source: Let us rally more closely around the Party Central Committee with Comrade Xi Jinping at its core, hold high the great banner of socialism with Chinese characteristics, follow the guidance of Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, and push forward in a concerted effort to complete the objectives and tasks for this year and celebrate the centenary of the Communist Party of China with outstanding achievements.
zh_cn: 让我们更加紧密地团结在以习近平同志为核心的党中央周围，高举中国特色社会主义伟大旗帜，以习近平新时代中国特色社会主义思想为指导，齐心协力，开拓进取，努力完成全年目标任务，以优异成绩庆祝中国共产党百年华诞，

source: Let each and every of us keep making tireless efforts to build China into a great modern socialist country that is prosperous, strong, democratic, culturally advanced, harmonious and beautiful, and fulfill the Chinese Dream of national rejuvenation.
zh_cn: 为把我国建设成为富强民主文明和谐美丽的社会主义现代化强国、实现中华民族伟大复兴的中国梦不懈奋斗！
